import React from 'react';
import './index.css'; 

const About = () => {
  return (
    <div className="about-page-container">
      <div className="about-content-card">
        <h2 className="about-main-heading">ჩვენ შესახებ</h2>
        
        <p className="about-paragraph">
          კომპანია არიკის მიზანია ბოლო საუკუნე-ნახევრის განმავლობაში ჩაწერილი და გამოცემული 
          მეგრული ზღაპრების მკითხველისათვის ვიზუალურად საინტერესო და ამავდროულად 
          შემეცნებითი მხატვრული ფორმით მიწოდება.
        </p>
        
        <p className="about-paragraph">
          გვსურს, საზოგადოებაში მეგრული ზეპირსიტყვიერებისადმი და ზოგადად ქართული კულტურის, 
          მეგრული სუბ-კულტურისადმი ინტერესის გაღვივება, ამ კულტურის შენარჩუნება და მომავალი 
          თაობებისთვის საინტერესოდ გადმოცემა. სწორედ ამ მიზნით შეიქმნა "ჩემი მეგრული 
          ჯადოსნური ზღაპრების" წიგნის სერია.
        </p>
        
        <p className="about-paragraph">
          "ჩემი მეგრული ჯადოსნური ზღაპრების" სერიის ზღაპრები ძირითადად 1876-1879 წლებში, 
          სამეგრელოში, ძირითადად საჩიჩაოს და სალიპარტიოს სოფლებში, მოგზაურობისას ჩაიწერა და 
          შემდგომ 1880 წელს გამოსცა ენათმეცნიერმა ალექსანდრე ცაგარელმა.
        </p>
      </div>
    </div>
  );
};

export default About;